src/data_analysis/collected_data/orange/api/standarda4v2/j/load_read.txt
Running 30m test @ http://20.90.250.192:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 3081.063ms, rate sampling interval: 11624ms
  Thread calibration: mean lat.: 3103.258ms, rate sampling interval: 11788ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.89m     7.54m   26.81m    59.31%
    Req/Sec    53.77      7.95    69.00     70.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.54m 
 75.000%   20.15m 
 90.000%   23.94m 
 99.000%   26.81m 
 99.900%   27.77m 
 99.990%   28.08m 
 99.999%   28.29m 
100.000%   28.35m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4362.239     0.000000            1         1.00
  177209.343     0.100000        19445         1.11
  354680.831     0.200000        38886         1.25
  533987.327     0.300000        58327         1.43
  731906.047     0.400000        77778         1.67
  872415.231     0.500000        97179         2.00
  938999.807     0.550000       106890         2.22
 1007157.247     0.600000       116648         2.50
 1074790.399     0.650000       126415         2.86
 1142947.839     0.700000       136157         3.33
 1209008.127     0.750000       145848         4.00
 1241513.983     0.775000       150726         4.44
 1276116.991     0.800000       155596         5.00
 1310719.999     0.825000       160345         5.71
 1350565.887     0.850000       165232         6.67
 1391460.351     0.875000       170042         8.00
 1414529.023     0.887500       172469         8.89
 1436549.119     0.900000       174904        10.00
 1457520.639     0.912500       177360        11.43
 1478492.159     0.925000       179756        13.33
 1499463.679     0.937500       182253        16.00
 1508900.863     0.943750       183456        17.78
 1518338.047     0.950000       184638        20.00
 1528823.807     0.956250       185932        22.86
 1539309.567     0.962500       187154        26.67
 1549795.327     0.968750       188327        32.00
 1555038.207     0.971875       188863        35.56
 1561329.663     0.975000       189508        40.00
 1567621.119     0.978125       190088        45.71
 1574961.151     0.981250       190695        53.33
 1584398.335     0.984375       191301        64.00
 1589641.215     0.985938       191605        71.11
 1595932.671     0.987500       191921        80.00
 1603272.703     0.989062       192211        91.43
 1610612.735     0.990625       192505       106.67
 1620049.919     0.992188       192835       128.00
 1624244.223     0.992969       192992       142.22
 1628438.527     0.993750       193115       160.00
 1633681.407     0.994531       193278       182.86
 1638924.287     0.995313       193425       213.33
 1644167.167     0.996094       193581       256.00
 1647312.895     0.996484       193669       284.44
 1649410.047     0.996875       193721       320.00
 1652555.775     0.997266       193805       365.71
 1654652.927     0.997656       193877       426.67
 1657798.655     0.998047       193963       512.00
 1659895.807     0.998242       194005       568.89
 1660944.383     0.998437       194026       640.00
 1663041.535     0.998633       194080       731.43
 1664090.111     0.998828       194101       853.33
 1666187.263     0.999023       194138      1024.00
 1667235.839     0.999121       194156      1137.78
 1669332.991     0.999219       194184      1280.00
 1670381.567     0.999316       194205      1462.86
 1671430.143     0.999414       194219      1706.67
 1673527.295     0.999512       194240      2048.00
 1674575.871     0.999561       194251      2275.56
 1674575.871     0.999609       194251      2560.00
 1675624.447     0.999658       194261      2925.71
 1677721.599     0.999707       194276      3413.33
 1678770.175     0.999756       194284      4096.00
 1678770.175     0.999780       194284      4551.11
 1679818.751     0.999805       194290      5120.00
 1680867.327     0.999829       194293      5851.43
 1681915.903     0.999854       194298      6826.67
 1682964.479     0.999878       194303      8192.00
 1684013.055     0.999890       194306      9102.22
 1685061.631     0.999902       194308     10240.00
 1686110.207     0.999915       194310     11702.86
 1688207.359     0.999927       194313     13653.33
 1690304.511     0.999939       194317     16384.00
 1690304.511     0.999945       194317     18204.44
 1690304.511     0.999951       194317     20480.00
 1691353.087     0.999957       194318     23405.71
 1692401.663     0.999963       194321     27306.67
 1692401.663     0.999969       194321     32768.00
 1692401.663     0.999973       194321     36408.89
 1693450.239     0.999976       194322     40960.00
 1693450.239     0.999979       194322     46811.43
 1694498.815     0.999982       194323     54613.33
 1697644.543     0.999985       194324     65536.00
 1697644.543     0.999986       194324     72817.78
 1697644.543     0.999988       194324     81920.00
 1697644.543     0.999989       194324     93622.86
 1700790.271     0.999991       194326    109226.67
 1700790.271     1.000000       194326          inf
#[Mean    =   833181.565, StdDeviation   =   452454.393]
#[Max     =  1699741.696, Total count    =       194326]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  196593 requests in 30.00m, 2.59GB read
  Socket errors: connect 0, read 46534, write 216009, timeout 129501
  Non-2xx or 3xx responses: 1353
Requests/sec:    109.22
Transfer/sec:      1.47MB